<?php
/*********************************************************************************************************************************************
作者：闫海静
功能：如果从数据库中选择出来的选项为1表示已经选择那么输出checked.
**********************************************************************************************************************************************/
	function smarty_function_checkeds($params){
		$type=$params['operType'];
		if($params['operArr'][$type]=='1'){
			$str="checked='checked' />";
		}else{
			$str=' />';
		}
		//P($params['operArr'][$type]);
		echo $str;
	}
?>