<?php
	/*+-----------------------------------------------------------------------------------------+
	  | 公共控制器
	  +-----------------------------------------------------------------------------------------+
	  | 版权所有 lamp兄弟连源代码小组						
	  +-----------------------------------------------------------------------------------------+
	  | 作者: 范培 (52web@sina.cn)							
	  | 最后修改时间: 2012-01-14 15:51  										
	  +-----------------------------------------------------------------------------------------+
	*/
	class Common extends Action {
		/*
			总是自己写的控制器的方法执行前先执行
		*/
		function init(){

			if(!file_exists('install/lock')){
				header('location:'.B_ROOT.'/install.php');//如果程序未安装则调转到安装界面
			}
			
			$this->assign('logo_name',LOGO);	//logo
			$this->assign('sms_num',D('user')->sms_num());//获取用户的短信数量

		}
	}