<?php
	/*+-----------------------------------------------------------------------------------------+
	  | 登陆/退出控制器
	  +-----------------------------------------------------------------------------------------+
	  | 版权所有 lamp兄弟连源代码小组						
	  +-----------------------------------------------------------------------------------------+
	  | 作者: 范培 (52web@sina.cn)							
	  | 最后修改时间: 2012-01-14 15:54  										
	  +-----------------------------------------------------------------------------------------+
	*/
	class Login{
		/*
			调用公共的登陆方法进行登陆
		*/
		public function login(){
			$login=D('user','admin');
			if($login->pub_login()){
				$this->success('登陆成功!',1);
			}else{
				$this->error('登陆失败',1);
			}
		}
		
		/*
			调用公共的退出方法
		*/
		public function logout(){
			$logout=D('user','admin');
			if($logout->pub_logout()){
				$this->success('退出成功!');
			}
		}
	}
?>